{
  "nodes": [
    {
      "op": "null", 
      "name": "spatial_features", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "418fdf08e2514887", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "3f6ff27770213e3f", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "be8d6d4b80b2ad50", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_1", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "90a4c710b59dc062", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_2", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "bb5fb70780d44639", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_3", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "3ac273d2cf431a68", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_4", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "13530c19b7c86988", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_5", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "03bebcd04eb295ae", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_6", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "2eb678f30485240d", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_7", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "03b24dc830774240", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_8", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "e7a57f08ec41a133", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_9", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "48dbdd7c74e97cde", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_10", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "67a2be9a2d36a37f", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_multiply_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "487f7e52caeef907", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_multiply_add_nn_relu", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "bf180289a34d4a82", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_11", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "c843c4f516927bd7", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_12", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "2c725c9a14acfd79", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_13", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "e785e3dee4788053", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_14", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "333792298722cbf8", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_15", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_16", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "73f9770a4fe258c9", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_16", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "eee5944438c87652", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_multiply_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW", 
        "kernel_layout": "IOHW", 
        "hash": "f5eeb71ce0696cf9", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_multiply_add_nn_relu_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW", 
        "flatten_data": "0", 
        "dst_layout": "NCHW4c", 
        "hash": "2cc323e8ca3465de", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_17", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "4a190a76cd7a8ba7", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_17", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_18", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "a3e0a61d16e651cd", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_18", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW2c", 
        "hash": "87e0464551faf566", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "out_layout": "NCHW3c", 
        "kernel_layout": "OIHW2i3o", 
        "hash": "f7bc43f3c94dcb52", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "data_layout": "NCHW2c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW3c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "ecbda28552922037", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_19", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "0ecfb7b39c7dda80", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_19", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW2c", 
        "hash": "87e0464551faf566", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i2o", 
        "hash": "17a5d0c49a3a1c55", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "out_layout": "NCHW2c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW2c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "1f400a9363e3af6c", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_20", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "f4aa3da112f9e69f", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_20", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_6", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW1c", 
        "hash": "25a149ccf2c53c9e", 
        "func_name": "tvmgen_default_fused_layout_transform_6", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW1c", 
        "kernel_layout": "OIHW1i1o", 
        "hash": "24b68826eb336f62", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_2", 
        "out_layout": "NCHW1c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_7", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW1c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "9ac36b4275b82d65", 
        "func_name": "tvmgen_default_fused_layout_transform_7", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "03eaa6919673fdb6", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_21", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3_2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW2c", 
        "hash": "87e0464551faf566", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i3o", 
        "hash": "7eb826544e1fad37", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_3", 
        "out_layout": "NCHW3c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW3c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "ecbda28552922037", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_22", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "cf3edb1d62856717", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_22", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3_3", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW2c", 
        "hash": "87e0464551faf566", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i2o", 
        "hash": "7a80d08b5c9b31b8", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_4", 
        "out_layout": "NCHW2c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5_1", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW2c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "1f400a9363e3af6c", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_23", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "711184c9a8d9c27e", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_relu_23", 
        "out_layout": "NCHW4c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3_4", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW4c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW2c", 
        "hash": "87e0464551faf566", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i2o", 
        "hash": "61b44c06fde3c8bf", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_5", 
        "out_layout": "NCHW2c", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5_2", 
      "attrs": {
        "num_outputs": "1", 
        "src_layout": "NCHW2c", 
        "flatten_data": "0", 
        "dst_layout": "NCHW", 
        "hash": "1f400a9363e3af6c", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0], 
  "heads": [
    [
      28, 
      0, 
      0
    ], 
    [
      32, 
      0, 
      0
    ], 
    [
      36, 
      0, 
      0
    ], 
    [
      40, 
      0, 
      0
    ], 
    [
      44, 
      0, 
      0
    ], 
    [
      48, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 32, 560, 560], 
        [1, 8, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 4], 
        [1, 32, 280, 280, 4], 
        [1, 32, 280, 280, 4], 
        [1, 32, 280, 280, 4], 
        [1, 32, 280, 280, 4], 
        [1, 32, 280, 280, 4], 
        [1, 32, 280, 280, 4], 
        [1, 128, 280, 280], 
        [1, 128, 560, 560], 
        [1, 64, 140, 140, 4], 
        [1, 64, 140, 140, 4], 
        [1, 64, 140, 140, 4], 
        [1, 64, 140, 140, 4], 
        [1, 64, 140, 140, 4], 
        [1, 64, 140, 140, 4], 
        [1, 256, 140, 140], 
        [1, 128, 560, 560], 
        [1, 96, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 2], 
        [1, 1, 560, 560, 3], 
        [1, 3, 560, 560], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 2], 
        [1, 1, 560, 560, 2], 
        [1, 2, 560, 560], 
        [1, 16, 560, 560, 4], 
        [1, 64, 560, 560, 1], 
        [1, 1, 560, 560, 1], 
        [1, 1, 560, 560], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 2], 
        [1, 1, 560, 560, 3], 
        [1, 3, 560, 560], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 2], 
        [1, 1, 560, 560, 2], 
        [1, 2, 560, 560], 
        [1, 16, 560, 560, 4], 
        [1, 32, 560, 560, 2], 
        [1, 1, 560, 560, 2], 
        [1, 2, 560, 560]
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        1, 
        2, 
        1, 
        2, 
        3, 
        1, 
        3, 
        1, 
        3, 
        1, 
        3, 
        4, 
        3, 
        1, 
        3, 
        1, 
        3, 
        1, 
        3, 
        1, 
        3, 
        2, 
        4, 
        1, 
        5, 
        6, 
        4, 
        1, 
        5, 
        7, 
        4, 
        1, 
        5, 
        8, 
        4, 
        1, 
        5, 
        9, 
        4, 
        1, 
        5, 
        10, 
        4, 
        1, 
        5, 
        11
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49
  ]
}