{
  "nodes": [
    {
      "op": "null", 
      "name": "input_features", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "d5604fa54cf1b02b", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack", 
        "hash": "5db1cf049756c52e", 
        "weight_layout": "NC8n"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_multiply_add_transpose_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "57204908ae5db1f8", 
        "func_name": "tvmgen_default_fused_reshape_transpose_multiply_add_transpose_nn_relu"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_max", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "f0cf828ebed5ac91", 
        "func_name": "tvmgen_default_fused_max"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_broadcast_to_tile_concatenate_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "hash": "9c46aab63d55929f", 
        "func_name": "tvmgen_default_fused_broadcast_to_tile_concatenate_reshape"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
        "hash": "6b1953d8af25bb59", 
        "weight_layout": "NC8n"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_transpose_multiply_add_transpose", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "2c5291a698755889", 
        "func_name": "tvmgen_default_fused_reshape_transpose_multiply_add_transpose"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_relu_max", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "bc89a4eebb055963", 
        "func_name": "tvmgen_default_fused_nn_relu_max"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0], 
  "heads": [
    [
      8, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [40000, 32, 9], 
        [1280000, 9], 
        [1280000, 16], 
        [40000, 32, 16], 
        [40000, 1, 16], 
        [1280000, 32], 
        [1280000, 32], 
        [40000, 32, 32], 
        [40000, 1, 32]
      ]
    ], 
    "device_index": [
      "list_int", 
      [1, 1, 1, 1, 1, 1, 1, 1, 1]
    ], 
    "storage_id": [
      "list_int", 
      [0, 0, 1, 2, 3, 1, 2, 1, 3]
    ]
  }, 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
}